### 7.1.1 누락된 데이터 골라내기

In [2]:
from numpy import nan as NA
import pandas as pd

data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [3]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [6]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA

In [10]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [11]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
import numpy as np

df = pd.DataFrame(np.random.randn(7,3))

df.iloc[:4,1]=NA

df.iloc[:2,2]=NA

df

          0         1         2
0 -0.420779       NaN       NaN
1 -0.372405       NaN       NaN
2 -0.680766       NaN  0.824364
3  0.722133       NaN -0.177102
4 -0.591106 -0.013972  0.133846
5  0.508290  1.135923  1.030772
6  0.710167  0.236542  2.161481

In [14]:
df.dropna()

          0         1         2
4 -0.591106 -0.013972  0.133846
5  0.508290  1.135923  1.030772
6  0.710167  0.236542  2.161481

In [15]:
df.dropna(thresh = 2)

          0         1         2
2 -0.680766       NaN  0.824364
3  0.722133       NaN -0.177102
4 -0.591106 -0.013972  0.133846
5  0.508290  1.135923  1.030772
6  0.710167  0.236542  2.161481

### 7.1.2 결측치 채우기

In [16]:
df.fillna(0)

          0         1         2
0 -0.420779  0.000000  0.000000
1 -0.372405  0.000000  0.000000
2 -0.680766  0.000000  0.824364
3  0.722133  0.000000 -0.177102
4 -0.591106 -0.013972  0.133846
5  0.508290  1.135923  1.030772
6  0.710167  0.236542  2.161481

In [17]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.420779  0.500000  0.000000
1 -0.372405  0.500000  0.000000
2 -0.680766  0.500000  0.824364
3  0.722133  0.500000 -0.177102
4 -0.591106 -0.013972  0.133846
5  0.508290  1.135923  1.030772
6  0.710167  0.236542  2.161481

In [18]:
_ = df.fillna(0,inplace=True)

In [19]:
df

          0         1         2
0 -0.420779  0.000000  0.000000
1 -0.372405  0.000000  0.000000
2 -0.680766  0.000000  0.824364
3  0.722133  0.000000 -0.177102
4 -0.591106 -0.013972  0.133846
5  0.508290  1.135923  1.030772
6  0.710167  0.236542  2.161481

In [20]:
df = pd.DataFrame(np.random.randn(6,3))

df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

df

          0         1         2
0 -0.548199  0.355899 -0.419028
1 -0.149887  1.990686  2.915349
2  0.991497       NaN  0.484756
3  1.238637       NaN -1.540651
4  1.265668       NaN       NaN
5 -0.604778       NaN       NaN

In [22]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.548199  0.355899 -0.419028
1 -0.149887  1.990686  2.915349
2  0.991497  1.990686  0.484756
3  1.238637  1.990686 -1.540651
4  1.265668  1.990686 -1.540651
5 -0.604778  1.990686 -1.540651

In [23]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0 -0.548199  0.355899 -0.419028
1 -0.149887  1.990686  2.915349
2  0.991497  1.990686  0.484756
3  1.238637  1.990686 -1.540651
4  1.265668       NaN -1.540651
5 -0.604778       NaN -1.540651

In [24]:
data = pd.Series([1.,NA,3.5,NA,7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 데이터 변형

### 7.2.1 중복 제거하기

In [25]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                     'k2':[1,1,2,3,3,4,4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1']=range(7)

data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [29]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [30]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 함수나 매핑을 이용해서 데이터 변형하기

In [31]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                             'pastrami','honey ham','nova lox'],
                     'ounces':[4,3,12,6,7.7,8,3,5,6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.7
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [33]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [36]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.7     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [37]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 7.2.3 값 치환하기

In [38]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 축 색인 이름 바꾸기

In [43]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio','Colorado','New York'],
                    columns = ['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [45]:
transform = lambda x:x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [49]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [51]:
data.rename(index = {'OHIO':'INDIANA'},
            columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

### 7.2.5 개별화와 양자화

In [53]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [54]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [55]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [56]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [58]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [59]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.54, 0.73], (0.35, 0.54], (0.54, 0.73], (0.17, 0.35], (0.73, 0.92], ..., (0.54, 0.73], (0.54, 0.73], (0.17, 0.35], (0.54, 0.73], (0.17, 0.35]]
Length: 20
Categories (4, interval[float64]): [(0.17, 0.35] < (0.35, 0.54] < (0.54, 0.73] < (0.73, 0.92]]

In [61]:
data = np.random.randn(1000)

cats = pd.qcut(data,4)
cats

[(0.649, 2.903], (-0.695, -0.0322], (-0.695, -0.0322], (-0.695, -0.0322], (-0.0322, 0.649], ..., (-0.695, -0.0322], (0.649, 2.903], (-3.065, -0.695], (0.649, 2.903], (-3.065, -0.695]]
Length: 1000
Categories (4, interval[float64]): [(-3.065, -0.695] < (-0.695, -0.0322] < (-0.0322, 0.649] < (0.649, 2.903]]

In [62]:
pd.value_counts(cats)

(0.649, 2.903]       250
(-0.0322, 0.649]     250
(-0.695, -0.0322]    250
(-3.065, -0.695]     250
dtype: int64

In [63]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(1.28, 2.903], (-1.205, -0.0322], (-1.205, -0.0322], (-1.205, -0.0322], (-0.0322, 1.28], ..., (-1.205, -0.0322], (1.28, 2.903], (-3.065, -1.205], (-0.0322, 1.28], (-1.205, -0.0322]]
Length: 1000
Categories (4, interval[float64]): [(-3.065, -1.205] < (-1.205, -0.0322] < (-0.0322, 1.28] < (1.28, 2.903]]

### 7.2.6 특잇값을 찾고 제외하기

In [64]:
data = pd.DataFrame(np.random.randn(1000,4))

In [65]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003278    -0.000576    -0.039831     0.006120
std       0.999617     1.017251     0.995595     0.981243
min      -3.211619    -2.766203    -2.897905    -2.991231
25%      -0.681324    -0.678578    -0.708331    -0.652360
50%      -0.004362     0.014496    -0.034713    -0.020331
75%       0.685805     0.682290     0.647875     0.639590
max       2.967691     3.282116     3.792320     3.310932

In [67]:
col = data[2]
col[np.abs(col)>3]

73     3.089989
457    3.792320
Name: 2, dtype: float64

In [68]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
15   1.890392  0.209984 -0.225954  3.215400
73   1.099325  0.294970  3.089989 -0.535508
167  0.770703  3.282116 -1.069188  0.196721
429  0.656361  0.652875  0.712542  3.249055
457  0.775916  0.121243  3.792320 -1.206040
941 -1.708081 -0.698202 -0.149588  3.310932
977 -3.211619  0.889199 -0.502346  1.320538

In [70]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003490    -0.000858    -0.040714     0.005345
std       0.998958     1.016378     0.992574     0.978767
min      -3.000000    -2.766203    -2.897905    -2.991231
25%      -0.681324    -0.678578    -0.708331    -0.652360
50%      -0.004362     0.014496    -0.034713    -0.020331
75%       0.685805     0.682290     0.647875     0.639590
max       2.967691     3.000000     3.000000     3.000000

In [71]:
np.sign(data).head() #양수 음수

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1 -1.0  1.0 -1.0  1.0
2  1.0 -1.0 -1.0  1.0
3  1.0  1.0 -1.0  1.0
4 -1.0 -1.0  1.0  1.0

### 7.2.7 치환과 임의 샘플링

In [74]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([0, 2, 1, 3, 4])

In [75]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [76]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [77]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [78]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)

In [79]:
draws

0    5
3    6
0    5
2   -1
1    7
0    5
3    6
1    7
0    5
0    5
dtype: int64

### 7.2.8 표시자/더미 변수 계산하기

In [80]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                   'data1':range(6)})

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [84]:
dummies = pd.get_dummies(df['key'],prefix='key')

df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## 7.3 문자열 다루기

### 7.3.1 문자열 객체 메서드

In [1]:
val = 'a,b, guido'

val.split(',')

['a', 'b', ' guido']

In [3]:
pieces = [x.strip() for x in val.split(',')]

pieces

['a', 'b', 'guido']

In [4]:
first, second, third = pieces

first+"::"+second+"::"+third

'a::b::guido'

In [6]:
'::'.join(pieces)

'a::b::guido'

In [8]:
'guido' in val

True

In [14]:
val.index(',') #찾지 못하면 예외처리

1

In [16]:
val.find(':') #찾지 못하면 -1 리턴

-1

In [17]:
val.count(',')

2

In [18]:
val.replace(',','::')

'a::b:: guido'

### 7.3.2 정규 표현식

In [19]:
import re

text = "foo bar\t baz \tqux"

re.split('\s+',text) # \s+ 는 하나 이상의 공백 문자를 의미

['foo', 'bar', 'baz', 'qux']

정규표현식이 먼저 실행되고 split가 실행

In [21]:
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [23]:
regex.findall(text) #정규표현식에 매칭된 모든 패턴 목록

[' ', '\t ', ' \t']

In [26]:
text = """
Dave dave@google.com
Steve steve@gmail.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE) #IGNORECASE는 대소문자 안가림

In [27]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com']

In [32]:
m = regex.search(text)

text[m.start():m.end()]

'dave@google.com'

search는 첫번째 이메일만 알려줌

In [33]:
print(regex.sub('kkkk',text))

Dave kkkk
Steve kkkk

sub는 치환

In [34]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

regex = re.compile(pattern, flags = re.IGNORECASE)

In [36]:
m = regex.match('wesm@bright.com')

m.groups()

('wesm', 'bright', 'com')

In [37]:
regex.findall(text)

[('dave', 'google', 'com'), ('steve', 'gmail', 'com')]

In [38]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix:\3',text))

Dave Username: dave, Domain: google, Suffix:com
Steve Username: steve, Domain: gmail, Suffix:com

### 7.3.3 pandas의 벡터화된 문자열 함수

In [41]:
import pandas as pd
import numpy as np

data = {'Dave':'dave@google.com', 'Steve':'steve@gmail.com','Wes':np.nan}
data = pd.Series(data)

data

Dave     dave@google.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [42]:
data.isnull()

Dave     False
Steve    False
Wes       True
dtype: bool

In [43]:
data.str.contains('gmail')

Dave     False
Steve     True
Wes        NaN
dtype: object

In [44]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [45]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [46]:
data.str[:5]

Dave     dave@
Steve    steve
Wes        NaN
dtype: object